---
kind: type
id: T:Autodesk.Revit.Exceptions.DisabledDisciplineException
source: html/3693dcdf-67fb-0128-3be8-cad150e9498e.htm
---
# Autodesk.Revit.Exceptions.DisabledDisciplineException

The exception that is thrown when the function cannot execute because
a discipline is disabled. The exception specifies which discipline(s) would let
the operation succeed.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class DisabledDisciplineException : InvalidOperationException
```